testdata/trace/expected.mmd
flowchart TD
  m_f178eb338fce["com.foo.Audit.record()"]
  m_d476e84e6bdb["com.foo.BaseWorkflow.initialize()"]
  m_eabd356c3532["com.foo.Helper.<init>()"]
  m_6e6e7d2457b4["com.foo.Helper.work()"]
  m_e12e5f041264["com.foo.Workflow.finish()"]
  m_6c09a7835283["com.foo.Workflow.prepare()"]
  m_45ad6583a724["com.foo.Workflow.start()"]
  m_6e6e7d2457b4 --> m_f178eb338fce
  %% cycle
  m_e12e5f041264 --> m_6c09a7835283
  m_6c09a7835283 --> m_e12e5f041264
  m_45ad6583a724 --> m_f178eb338fce
  m_45ad6583a724 --> m_d476e84e6bdb
  m_45ad6583a724 --> m_eabd356c3532
  m_45ad6583a724 --> m_6e6e7d2457b4
  m_45ad6583a724 --> m_6e6e7d2457b4
  m_45ad6583a724 --> m_6c09a7835283
